In [1]:
import os 
import pandas as pd
from sqlalchemy import create_engine

In [2]:
engine = create_engine('postgresql://root:root@localhost:5432/ny_taxi')

In [3]:
engine.connect()

In [5]:
# Question 3

query = """
	select count(*)
	from yellow_taxi_trips
	where lpep_pickup_datetime >= date '2019-01-15'
		and lpep_dropoff_datetime < date '2019-01-16'
	"""

pd.read_sql(query, con=engine)

   count
0  20530

In [6]:
# Question 4
query = """
	select lpep_pickup_datetime, trip_distance
    from yellow_taxi_trips
    where trip_distance = (select max(trip_distance) from yellow_taxi_trips) 
	"""

pd.read_sql(query, con=engine)

  lpep_pickup_datetime  trip_distance
0  2019-01-15 19:27:58         117.99

In [9]:
# Question 5
query = """
	select passenger_count, count(*)
	from yellow_taxi_trips
	where lpep_pickup_datetime >= date '2019-01-01'
		and lpep_pickup_datetime < date '2019-01-02'
        and passenger_count in (2, 3)
    group by passenger_count
	"""

pd.read_sql(query, con=engine)

   passenger_count  count
0                2   1282
1                3    254

In [10]:
# Question 6
query = """
    select 
        max(a.tip_amount)
    from yellow_taxi_trips a
    inner join zone_lookup b
        on a."PULocationID" = b."LocationID"
    inner join zone_lookup c
        on a."DOLocationID" = c."LocationID"
    where b."Zone" = 'Astoria'
    """

pd.read_sql(query, con=engine)

    max
0  88.0

In [11]:
query = """
	select 
		c.*
	from yellow_taxi_trips a
	inner join zone_lookup b
		on a."PULocationID" = b."LocationID"
	inner join zone_lookup c
		on a."DOLocationID" = c."LocationID"
	where b."Zone" = 'Astoria'
		and a.tip_amount = 88;
	"""

pd.read_sql(query, con=engine)

   index  LocationID Borough                           Zone service_zone
0    145         146  Queens  Long Island City/Queens Plaza    Boro Zone